6_semester/КИСП/Курсовая/src/Documents/СписаниеКомпьютеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СписаниеКомпьютеров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияСтатусовПК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Компьютеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компьютер</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Компьютеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

6_semester/КИСП/Курсовая/src/InformationRegisters/ИсторияСтатусовПК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСтатусовПК</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКомпьютеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

6_semester/КИСП/Курсовая/src/Enums/СостоянияКомпьютеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияКомпьютеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

6_semester/КИСП/Курсовая/src/Documents/СписаниеКомпьютеров/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого СтрокаТЧ Из Компьютеры Цикл
		Если СтрокаТЧ.Компьютер.Состояние = Перечисления.СостоянияКомпьютеров.Списан Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Компьютер """ + Строка(СтрокаТЧ.Компьютер) + """ уже списан!";
			Сообщение.Поле = "Компьютеры[" + (СтрокаТЧ.НомерСтроки - 1) + "].Компьютер";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Для Каждого СтрокаТЧ Из Компьютеры Цикл
		Движение = Движения.ИсторияСтатусовПК.Добавить();
		Движение.Период = Дата;
		Движение.Компьютер = СтрокаТЧ.Компьютер;
		Движение.Статус = Перечисления.СтатусыКомпьютеров.Списан;
		
		КомпОбъект = СтрокаТЧ.Компьютер.ПолучитьОбъект();
		КомпОбъект.Состояние = Перечисления.СостоянияКомпьютеров.Списан;
		КомпОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
